app/controllers/attendees_controller.rb

SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = 2 AND "attendees"."email" = 'sean@email.com' LIMIT 1
INSERT INTO "attendees" ("name", "email", "rsvp", "event_id", "created_at", "updated_at") VALUES ('z\z\', 'sean@email.com', 1, 7, '2025-03-05 10:06:08.272301', '2025-03-05 10:06:08.272301') RETURNING "id"
---
  def create
    existing_attendee = @event.attendees.find_by(email: attendee_params[:email])
    if existing_attendee
      render json: existing_attendee, status: :ok
    else
      @attendee = @event.attendees.new(attendee_params)

      if @attendee.save

UPDATE "attendees" SET "email" = 'FRs@email.com', "updated_at" = '2025-03-05 12:35:57.718399' WHERE "attendees"."id" = 2
---
  def update
    if @attendee.update(attendee_params)

DELETE FROM "attendees" WHERE "attendees"."id" = 1
---
  def destroy
    @attendee.destroy

SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = 4 AND "attendees"."id" = 1 LIMIT 1
---
  def set_attendee
    @attendee = @event.attendees.find(params[:id])