app/controllers/comments_controller.rb

  def create
    @comment = @event.comments.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES ('edsds', 1, 7, '2025-03-05 09:52:58.740217', '2025-03-05 09:52:58.740217') RETURNING "id"

  def destroy
    begin
      @comment = Comment.find(params[:id])
      @comment.destroy!
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 3 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 3