app/controllers/events_controller.rb

    def set_event
      @event = Event.find(params.expect(:id))
---
SELECT "events".* FROM "events" WHERE "events"."id" = 2 LIMIT 1