app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "date", "location", "recurrence", "created_at", "updated_at") VALUES ('R', 'rrr', '2025-03-12 20:23:00', NULL, 'daily', '2025-03-04 20:23:43.898803', '2025-03-04 20:23:43.898803') RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    if @event.save

UPDATE "events" SET "title" = 'rrrr', "updated_at" = '2025-03-04 20:46:15.791948' WHERE "events"."id" = 2
---
  def update
    if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = 1
---
  def destroy
    @event.destroy!

INSERT INTO "tickets" ("price", "seat_number", "user_id", "event_id", "created_at", "updated_at") VALUES (25.0, 'A1', NULL, 7, '2025-03-05 12:16:36.621825', '2025-03-05 12:16:36.621825') RETURNING "id"
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."event_id" = 7
---
  def generate_tickets

    count = params[:count].presence || 10
    base_price = params[:base_price].presence || 25.00

    generated_count = 0

    count.to_i.times do |i|
      seat_row = (65 + (i / 10)).chr
      seat_number = "#{seat_row}#{(i % 10) +1}"

      row_premium = (seat_row.ord - 65) * 5.00
      ticket_price = base_price.to_f + row_premium

      ticket = @event.tickets.create(
        price: ticket_price,
        seat_number: seat_number,
      )

      generated_count += 1 if ticket.persisted?
    end

    render json: {
      success: true,
      message: "#{generated_count} tickets generated successfully ",
      ticket_count: @event.tickets.count