app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = 7
---
  def index
    @tickets = @event ? @event.tickets : Ticket.all

UPDATE "tickets" SET "price" = 24.98, "updated_at" = '2025-03-05 15:49:28.185862' WHERE "tickets"."id" = 2
---
  def update
    if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = 2
---
  def destroy
    @ticket.destroy!

SELECT "events".* FROM "events" WHERE "events"."id" = 7 LIMIT 1
---
  def set_event
    @event = Event.find(params[:event_id]) if params[:event_id]